[
{"page": "1","img": "img-1.jpg","content": "User Manualv1.02023.08"},{"page": "2","img": "img-2.jpg","content": "This document is copyrighted by DJI with all rights reserved. Unless otherwise authorized by DJI,you are not eligible to use or allow others to use the document or any part of the document byreproducing, transferring, or selling the document. Users should only refer to this documentand the content thereof as instructions to operate DJI products. The document should not beused for other purposes.Searching for KeywordsSearch for keywords such as Battery or Install to find a topic. If you are using AdobeAcrobat Reader to read this document, press Ctrl+F on Windows or Command+F on Macto begin a search.Navigating to a TopicView a complete list of topics in the table of contents. Click on a topic to navigate to thatsection.Printing this DocumentThis document supports high resolution printing.2© 2023 DJI All Rights Reserved."},{"page": "3","img": "img-3.jpg","content": "DJI Osmo Action 4 User ManualUsing this ManualLegendsImportantHints and TipsRead Before UseRead the following documents before using DJI™ OSMO™ Action 4.1. Osmo Action 4 Safety Guidelines2. Osmo Action 4 Quick Start Guide3. Osmo Action 4 User ManualIt is recommended to watch all tutorial videos and read the safety guidelines before using forthe first time. Make sure to review the Quick Start Guide before using for the first time and referto this User Manual for more information.Download DJI Mimo App and Watch the Tutorial VideoScan the QR code to download the DJI Mimo App and watch the tutorial videos.DJI Mimo AppDJI Store Apphttps://s.dji.com/guide60iOS 12.0 or aboveAndroid 8.0 or above© 2023 DJI All Rights Reserved.3"},{"page": "4","img": "img-4.jpg","content": "Contents4Using this Manual3Legends3Read Before Use3Download DJI Mimo App and Watch the Tutorial Video3Contents4Product Profile5Overview5Accessories6Using for the First Time9Attaching the Battery9Inserting the microSD Card9Activating Osmo Action 410Charging Osmo Action 410Operation11Button Features11Operating the Touchscreen11Status LED Descriptions20Storing Photos and Videos20Transferring Files21Webcam Mode22Microphone Connection22DJI Mimo App23Download the DJI Mimo App23Connecting to the DJI Mimo App23DJI Mimo App Home Screen24Camera View25Maintenance27Firmware Update27Underwater Usage Notes27Cleaning Notes28Battery Usage Notes28Using Other Accessories (Not Included)29Specifications32© 2023 DJI All Rights Reserved."},{"page": "5","img": "img-5.jpg","content": "DJI Osmo Action 4 User ManualProduct ProfileOsmo Action 4 is capable of capturing smooth video at up to 4K/120fps and offers a 155°super-wide FOV. With DJI’s latest EIS (Electronic Image Stabilization) technology, Osmo Action4 can record super smooth footage for various sports scenes. With a 1/1.3-inch image sensor,the camera ensures low-noise footage in sports scenarios and low-light scenes with a highdynamic range or high contrast. In addition, D-Log M color mode provides a more comfortablecolor perception and a larger dynamic range, which is convenient for post-production colorcorrection.Osmo Action 4 is equipped with dual touchscreens. The front touchscreen helps capture theperfect selfie, while the rear touchscreen displays the liveview of the camera. Both touchscreensenable users to change the settings with fingertip movements. The buttons on the cameraenable users to control recording or switch the shooting mode. Osmo Action 4 is waterproof atdepths of up to 18 m. With different Osmo accessories, users can enjoy the full range of OsmoAction 4 features.Overview1. Shutter/Record Button1312. Front Touchscreen3. Lens4. Status LED I5. Microphone I6. Color Temperature Photo Sensor1211109823457. Microphone II6 78. USB-C Port9. USB-C Port Cover10. USB-C Port Cover Release Button11. Lens Protective Cover12. Quick Switch Button13. Speaker141617151814. Status LED II15. Rear Touchscreen16. Battery Compartment Cover17. microSD Card Slot2018. Battery Compartment Cover Release Button19. Windproof Microphone211920. Quick-Release Slot I21. Quick-Release Slot II© 2023 DJI All Rights Reserved.5"},{"page": "6","img": "img-6.jpg","content": "DJI Osmo Action 4 User ManualAccessoriesOsmo Action 4 is compatible with various accessories to flexibly change the position to shootvarious sports scenes.Osmo Action Curved Adhesive Base KitThe Osmo Action Curved Adhesive Base Kit includes the following accessories.AccessoryDescriptionOsmo Action Quick-Release Adapter Mount: with a magneticdesign, the quick-release adapter mount can be easily attachedto the camera and connected to other accessories.Osmo Locking Screw: secures the Osmo Action Quick-ReleaseAdapter Mount to the Osmo Action Curved Adhesive Base.Osmo Action Curved Adhesive Base: the base forms a strong,durable, and long-lasting bond on clean and curved surfaces,ensuring secure mounting.Press down on the camera until the clips of the quick-release adapter mount are firmly insertedinto the quick-release slots on the camera, and then tighten the locking screws. Wipe thesurface of the object before attaching the adhesive base. Attach and press the adhesive basedown firmly, and hold for at least 10 seconds. It is recommended to wait 30 minutes beforeattaching the camera.90°6© 2023 DJI All Rights Reserved.90°"},{"page": "7","img": "img-7.jpg","content": "DJI Osmo Action 4 User Manual• Press down on the camera until the clips of the quick-release adapter mount arefirmly inserted into the quick-release slots on the camera, and then tighten the lockingscrews. Press both clips of the quick-release adapter mount when removing thecamera.• Osmo Action Curved Adhesive Base can only be applied to clean curved surfaces once.DO NOT attach the curved adhesive base to surfaces that are flat, rough, powdered,peeling, covered in dust or sand, or have oil, wax, or water stains. Otherwise, theadapter mount may not be attached firmly.• The recommended application temperature for the base is -10° to 40° C (14° to 104° F).DO NOT attach the adhesive base to a surface with a higher or lower temperature.Osmo Action Horizontal-Vertical Protective FrameWith the Osmo Action Horizontal-Vertical Protective Frame, users can flip the camera from thehorizontal to the vertical position for different shooting angles. As shown in the figure below,open the buckle of the horizontal-vertical protective frame, align and place the camera into theframe, and then close the buckle. The left side of the frame is equipped with two quick-releaseslots, which can be used with the Osmo Action Quick-Release Adapter Mount to fasten otheraccessories such as the Osmo Action Curved Adhesive Base Kit and the Osmo 1.5m ExtensionRod.13290°90°© 2023 DJI All Rights Reserved.7"},{"page": "8","img": "img-8.jpg","content": "DJI Osmo Action 4 User ManualOsmo Action Extreme BatteryThe Osmo Action Extreme Battery boosts Osmo Action 4 performance across a widetemperature range from -20° to 45° C (4° F to 113° F). With a 1770 mAh capacity, the batterycan continuously work for up to 160 minutes.* Refer to Battery Usage Notes for more detailedinformation on battery usage.* Tested at room temperature (25°C/77°F) and 1080p/24fps (16:9), with RockSteady on, Wi-Fi off, and screenoff. This data is for reference only.Osmo Action Multifunctional Battery CaseThe Osmo Action Multifunctional Battery Case (hereinafter referred to as the battery case) isdesigned for storing two microSD cards and three Osmo Action Extreme Batteries safely. Userscan check the battery levels by pressing the button once or opening the battery case. Thestatus LEDs will display the battery level. When a charger is connected to the battery case withbatteries inserted, the battery case will charge the batteries. When the batteries are insertedinto the battery case, with external devices connected to the USB-C port, the batteries can beused as a power bank to charge the connected external devices.The batteries with the highest power level will be charged first, followed by the remainingbatteries to be charged in sequence. The batteries with the lowest power level will bedischarged first, followed by the remaining batteries to be discharged in sequence.When using the battery case to charge the Osmo Action Extreme Battery, it is recommendedto use the DJI 30 W USB-C Charger (not included as standard) or a USB-C charger that supportsPower Delivery or PPS (Programmable Power Supply). Three batteries can be fully charged inabout two hours with the DJI 30 W USB-C Charger.• DO NOT use the battery case to charge non-DJI OSMO batteries. DJI OSMO shall not beresponsible for any fault or damage caused by the use of any non-DJI OSMO battery.• Place the battery case on a flat and stable surface when in use. Make sure the device isproperly insulated to prevent fire hazards.• DO NOT attempt to touch the metal terminals on the battery ports.• Clean the metal terminals with a clean, dry cloth if there is any noticeable buildup.• The battery case is not waterproof. DO NOT place it in water or spill any liquid on thecase.8© 2023 DJI All Rights Reserved."},{"page": "9","img": "img-9.jpg","content": "DJI Osmo Action 4 User ManualUsing for the First TimeAttaching the Battery2Press the release button on the battery compartment cover and slide upward, then insert1the battery into the battery compartment, as shown below. Make sure the battery is properlyinserted, then close the battery compartment cover. Note: if the battery cover is properlymounted, the red marks on the bottom will not be visible.21Inserting the microSD CardThe footage shot on Osmo Action 4 is stored on a microSD card. A UHS-I Speed Grade 3rating microSD card is required due to the fast reading and writing speeds necessary for highresolution video data. Refer to the recommended microSD card list in Specifications for moreinformation. Insert the microSD card into the microSD card slot as shown.• Gently push the microSD card into the camera to partially eject the microSD card.© 2023 DJI All Rights Reserved.9"},{"page": "10","img": "img-10.jpg","content": "DJI Osmo Action 4 User ManualCharging Osmo Action 4Press the release button on the USB-C port cover and slide the cover down.Connect a USB-C charger (not included) to the USB-C port using the Type-C to Type-C PD cable(included). It is recommended to use the DJI 30 W USB-C Charger or a USB-C charger thatsupports Power Delivery or PPS (Programmable Power Supply). When the status LEDs turn off,the battery is fully charged. It takes about 18 minutes to charge the battery to 80%. The batterycan be fully charged in about 49 minutes.** Charging time was tested using a DJI 30 W USB-C Charger in a 25° C (77° F) environment. For reference only.Activating Osmo Action 4The DJI Mimo app is required for activation when using Osmo Action 4 for the first time. Followthe steps below to activate.1. Press and hold the Quick Switch Button to power on.2. Enable Wi-Fi and Bluetooth on the mobile device.3. Launch DJI Mimo, tap, and follow the instructions to activate Osmo Action 4.9:41发现学院DJI MIMODeviceACADEMYDeviceSUPPORTTEMPLATECOMMUNITYOSMO MOBILE 4MORE00 !3901!23Life Advice Looking Through...HomeOSMO ACTIONAlbumDo A Sporting StagEditMeMORERefer to the relevant sections in DJI Mimo App for more information on how to operate the app.10© 2023 DJI All Rights Reserved."},{"page": "11","img": "img-11.jpg","content": "DJI Osmo Action 4 User ManualOperationButton FeaturesQuick SwitchButtonShutter/RecordButtonShutter/Record Button• Press once: take a photo or start/stop recording.• Press and hold when powered off: power on quickly and begin shooting. The shooting modewill depend on the SnapShot settings. After shooting, the camera will automatically power offif left idle for three seconds.Quick Switch Button• Press and hold: power on/off.• Press once: switch between shooting modes.Operating the TouchscreenAfter the camera is powered on, both touchscreens of the camera display the liveview as well asthe shooting mode, battery level, and microSD card information. Tap or swipe on a touchscreento interact with the camera. Note: the two touchscreens cannot be operated at the same time.When one touchscreen is operated, the other touchscreen is locked.Operating the TouchscreenDescriptionsTapSelect the icons on both sides of the screen to playbackshot footage and change the camera settings.Swipe Down from the top of the ScreenEnters the control menu.© 2023 DJI All Rights Reserved.11"},{"page": "12","img": "img-12.jpg","content": "DJI Osmo Action 4 User ManualSwipe Left or RightSwitches between video, photo, and other shootingmodes.Swipe Up from the Bottom of the ScreenSets the shooting parameters such as Aspect Ratio,Countdown Timer, and Resolution.Camera View14:15420m22s2531080P / 301080P301.0X1.0x61. Storage Capacity Information20m22s : the icon displays either the storage capacity, the remaining number of photos orthe video duration that can be taken or recorded according to the current shooting mode.The icon is displayed only when a microSD card is inserted.2. Playback: tap to preview the last photo or video captured or played back. Swipe from the right toexit playback and go back to liveview.3. Shooting Modes: tap the icon and swipe to select the shooting mode.12Shooting ModesDescriptionTake a photoTake a photo or countdown photo.VideoRecord a video.© 2023 DJI All Rights Reserved."},{"page": "13","img": "img-13.jpg","content": "DJI Osmo Action 4 User ManualSlow MotionSupports 4x or 8x slow-motion video shooting. In Slow Motion mode,the camera records the video with a high frame rate and slows thefootage down to 4x or 8x the normal speed during playback. SlowMotion catches details not visible to the naked eye, which is ideal forfast-action shots. Note: slow-motion videos do not include audio. Theaudio file is stored as a standalone file and has the same path as thevideos, which can be transferred to your computer.TimelapseSelect from Hyperlapse and Timelapse. In this mode, the cameraturns long events into short videos by taking a frame of video at setintervals.Use Hyperlapse to record smooth timelapse videos when the camerais in motion (such as in a car or when held in the hand). Use Timelapseto record timelapse videos when the camera is mounted and still.Three presets in Timelapse are designed for typical scenes such asCrowds, Clouds, and Sunset. Users can also optimize the interval andduration for recording timelapse videos.4. Battery Level: this icon displays the current battery level of Osmo Action 4. Tap the icon to view moredetailed information about the battery level.5. Parameters: click to adjust the image and audio parameters. Tap PRO to adjust pro parameters.Various parameters can be set in different shooting modes.Shooting ModesParametersPhotoBasic ModeThe FOV and image parameters can be adjusted.1. FOV: the FOV can be set to Standard (Dewarp) or Wide.2. Image Adjustment: users can adjust the sharpness and noisereduction based on needs for optimal image quality.PRO ModeExposure, White Balance, FOV, Format, and Image Adjustment areavailable.1. Exposure: Auto and Manual modes are available.2. White Balance: Auto and Manual modes are available.3. FOV: the parameters are same with Basic Mode.4. Format: select the picture to be stored as JPEG or JPEG+RAW.5. Image Adjustment: the parameters are same with Basic Mode.© 2023 DJI All Rights Reserved.13"},{"page": "14","img": "img-14.jpg","content": "DJI Osmo Action 4 User ManualVideoBasic ModeFOV, Image Adjustment, EIS Priority in Low Light, and Low-Light ImageEnhancement are available.1. FOV: FOV can be set to Narrow, Standard (Dewarp), Wide, or UltraWide. Some FOV options are unavailable when using certain framerates.2. EIS Priority in Low Light: enabling EIS Priority in Low Light will removemotion blur and disable anti-flicker function. Image sharpness maybe affected when ambient light is too low.3. Image Adjustment: users can adjust the sharpness and noisereduction based on needs for optimal image quality.4. Low-Light Image Enhancement: when enabled, the camera willdetect low-light environment automatically and adjust exposureparameters intelligently to improve image quality.PRO ModeImage and audio parameters can be adjusted.Image Parameters: Exposure, White Balance, Color, FOV, ImageAdjustment, and Low-Light Image Enhancement are available.•Exposure: Auto and Manual modes are available.•White Balance: Auto and Manual modes are available.•Colors: Normal and D-Log M are available. D-Log M is designed forprofessional color grading in post-editing. In high-contrast or multicolor (e.g., garden, field, etc.) scenarios, it can enlarge the dynamicrange for more color-tuning space in post-production. 10-bit colordepth enables smoother color transition.•FOV: the parameters are same with Basic Mode.•Image Adjustment: the parameters are same with Basic Mode.•Low-Light Image Enhancement: the parameters are same with BasicMode.Audio Parameters: Channel, Wind Noise Reduction, and Gain areavailable.14•Channel: select from Stereo or Mono.•Wind Noise Reduction: when enabled, the camera will reduce thewind noise picked up by the built-in microphone using algorithms.Note: Wind Noise Reduction does not work when connected to theexternal microphone.•When a microphone is connected, the input gain of the microphonecan be adjusted.© 2023 DJI All Rights Reserved."},{"page": "15","img": "img-15.jpg","content": "DJI Osmo Action 4 User ManualSlow MotionBasic ModeThe FOV and image parameters can be adjusted.1. FOV: FOV can be set to Standard (Dewarp) or Wide.2. Image Adjustment: users can adjust the sharpness and noisereduction based on needs for optimal image quality.PRO ModeExposure, White Balance, Color, FOV, and Image Adjustment areavailable.1. Exposure Exposure: Auto and Manual modes are available.2. White Balance: Auto and Manual modes are available.3. Colors: Normal and D-Log M are available. D-Log M is designedfor professional color grading when post-editing. In high-contrastor multi-color (e.g., garden, field, etc.) scenarios, it can enlarge thedynamic range for more color-tuning in post-production. 10-bitcolor depth enables smoother color transition.4. FOV: the parameters are same with Basic Mode.5. Image Adjustment: the parameters are same with Basic Mode.TimelapseHyperlapseBasic Mode: FOV, EIS Priority in Low Light, and Image Adjustment areavailable.PRO Mode: Exposure, White Balance, Color, FOV, and Image Adjustmentare available.TimelapseBasic Mode: FOV and Image Adjustment are available.PRO Mode: Exposure, White Balance, FOV, Format, and Image Adjustmentare available.6. Zoom1.0 x : press and hold the icon, then drag to set the zoom ratio.© 2023 DJI All Rights Reserved.15"},{"page": "16","img": "img-16.jpg","content": "DJI Osmo Action 4 User ManualSwipe Down - Control MenuSwipe down from the edge of the screen to enter the control menu.123456781. Custom ModeTapand tapto save the current configuration as a custom mode. Save the shootingparameters in the custom mode, which can then be used directly to shoot similar scenes.Users can save up to five custom modes.2. Quick SwitchSet the modes accessible with the Quick Switch Button: Screen Switch, Custom Modes,Photo, Video, Slow Motion, Timelapse, Hyperlapse, and Playback. When Voice Prompt isenabled, the camera will voice broadcast the shooting mode once the quick switch button ispressed to change the mode. When the camera is installed on a helmet or other hard-to-seelocations, users can accurately select the required mode with Voice Prompt.3. BrightnessTap and move the slider to adjust the brightness.4. SettingsItemDescriptionSnapShotWhen Osmo Action 4 is powered off or in sleep mode, use SnapShotto quickly power on and begin shooting. Supported shooting modesinclude Photo, Video, Last Settings, Video, Hyperlapse, and CustomModes.After shooting, the camera will automatically power off if left idle forthree seconds.16Single ScreenPreview (Scrn OffWhen Locked)When enabled, only one touchscreen will turn on. Tap and swipe upon the touchscreen to unlock the screen.Voice ControlTap to enable voice control to use the camera with voice commands.Mandarin Chinese and English are supported. Voice commands inEnglish include Start Recording, Stop Recording, Take Photo, and ShutDown.© 2023 DJI All Rights Reserved."},{"page": "17","img": "img-17.jpg","content": "DJI Osmo Action 4 User ManualOTG ConnectionTap OTG Connection and connect the camera to an Android devicewith the Type-C to Type-C PD cable (included). With OTG connection,the files can be transferred from the camera to an Android device.Note: OTG Connection is only available when the Android devicesupports OTG connection.WirelessConnectionTap to check wireless information, select Wi-Fi frequency, and resetthe Wi-Fi connection. Connect the camera to DJI Mimo wirelessly toupdate the firmware version.VideoCompressionTap to switch the video-encoding format between Efficiency andCompatibility modes. If Efficiency is selected, videos will be encoded inHEVC with a smaller file size. If Compatibility is selected, videos will beencoded in H.264 with higher compatibility.SoundsTap to set volume. High, medium, low, and mute are available.GridTap to display grid lines in liveview photos or videos to help level thecamera vertically and horizontally. The display options include Grid,Diagonals, and Grid & Diagonals.TimecodeTap to set Timecode for the camera. When setting Timecode, thecamera can be synchronized by the system settings. Also, the cameracan be synchronized by the time code synchronizer using the USB-Cport.NamingManagementTap to edit the naming rules for storage folders and files.Scrn Off When Rec Tap to set the time. After recording starts, the screen will turn off afterthe set time. This will not affect the recording.Auto Power OffTap to set the time. The camera will power off automatically whenthere is no operation on camera within the set duration.LEDTurn the two status LEDs on Osmo Action 4 on or off.HorizonCalibrationTap to calibrate the horizon according to the prompts on the screen.Continue LastLivestreamTap to enable, so the camera can continue the last livestream after ithas stopped. Note: Livestream is only available on DJI Mimo.LanguageTap to set the language to English, Simplified Chinese,TraditionalChinese, Japanese, Korean, Thai, Arabic, German, Spanish, French,Italian, Russian, Brazilian Portuguese, Turkish, Indonesian, or Polish.Date and TimeTap to set the date and time of the camera system.FormatTap and swipe to format the microSD card. Formatting willpermanently delete all data on the microSD card. Make sure to backup all required data before formatting.Factory ResetTap to restore the camera to its original factory settings. This willdelete all the current settings, and the camera will be restored to theoriginal factory settings and restart.© 2023 DJI All Rights Reserved.17"},{"page": "18","img": "img-18.jpg","content": "DJI Osmo Action 4 User ManualDevice InfoTap to view the device name, serial number, firmware version, quickstart guide, and export the log. Tap Export Log to export the log to themicroSD card. When the camera is connected to the Osmo Action GPSremote controller, users can view the firmware version of the remotecontroller.Compliance InfoTap to view the compliance information.5. Orientation LockTap to switch between automatic orientation and locked orientation.6. Screen LockTap to lock the screen. Swipe up on the touchscreen to unlock the screen.7. Voice ControlTap to enable Voice Control so the user can control the camera with set voice commands.Voice Control is useful in the sports scenarios where hands are busy such as when cycling orskiing.8. Full Front ScreenTap to enable or disable full screen display on the front screen.18© 2023 DJI All Rights Reserved."},{"page": "19","img": "img-19.jpg","content": "DJI Osmo Action 4 User ManualSwipe Up - Parameters SettingsSwipe up from the bottom of the screen to set the parameters for each shooting mode.Shooting ModesSettingsPhotoSet Aspect Ratio and Countdown Timer.VideoSet video resolution and frame rate.Tap the upper left corner to set the duration of the loop recording.When using loop recording, the camera records a video byoverwriting older footage with new footage at selected intervals.Use loop recording when trying to capture a spontaneous moment(e.g., during fishing). This allows the camera to keep recording whilesaving space on the microSD card.Tap on the upper right corner to turn off EIS and enable RockSteady,RockSteady+, HorizonBalancing, or HorizonSteady. For differentresolutions and frame rates, certain EIS modes can only be selected.Different EIS modes have different stablization performance.•Disabled: when selected, record the video with the largest FOV.•RockSteady: stabilizing footage while retaining the dynamicsof movement, which is suitable for first-person perspectiveshooting.•RockSteady+: compared with RockSteady, the edges of theseimages will be cut off more to obtain stronger stabilizationperformance.•HorizonBalancing: this mode corrects shakes for any horizontalrotation (45°). In this mode, 4K resolution video is supported.•HorizonSteady: this mode corrects shakes for any horizontalrotation (360°) and locks onto a leveled horizon in every frame,regardless of how the camera is mounted or worn.Slow MotionSet the video resolution and speed ratio.HyperlapseSelect Hyperlapse or Timelapse mode. The speed ratio can be set inHyperlapse mode. The scene, interval time, and shooting time canbe set when using Timelapse.Tap the upper right corner to set the resolution when usingTimelapse.© 2023 DJI All Rights Reserved.19"},{"page": "20","img": "img-20.jpg","content": "DJI Osmo Action 4 User ManualStatus LED DescriptionsOsmo Action 4 has two status LEDs which indicate the same status information. They can beturned on and off.Blinking PatternDescriptionSolid greenReady to useTemporarily offTaking a photoBlinks greenOsmo Action 4 is charging when powered offBlinks red and greenalternatelyUpdating firmwareBlinks red slowlyRecording a video or taking a countdown photoBlinks red three timesrapidlyPowers off the camera or powers on the camera at low battery levelOffMicroSD card abnormality (no microSD card detected, microSD cardstorage is full, or microSD card error.)Status LED IIStatus LED IStoring Photos and VideosThe footage shot on Osmo Action 4 can only be stored on a microSD card (not included). AUHS-I Speed Grade 3 rating microSD card is required due to the fast read and write speedsnecessary for high-resolution video data. The photos and videos can be transferred to a mobiledevice or computer. Refer to Transferring Files for detailed information.20© 2023 DJI All Rights Reserved."},{"page": "21","img": "img-21.jpg","content": "DJI Osmo Action 4 User ManualTransferring FilesTransferring Files to a PhoneConnect Osmo Action 4 to DJI Mimo, tap the Playback icon to preview photos and videos. Clickto download photos and videos. The photos and videos can be shared directly from DJI Mimoto social media platforms.Transferring Files to a ComputerPower on Osmo Action 4 and connect it to a computer using a USB-C cable. When connectedto a computer, a pop-up will appear, this prompts the user to select the USB connection typeon the camera touchscreen. Tap Transfer File to download the files from the camera to thecomputer. When transferring a file, the camera cannot take photos or record videos.Select Cancel to only charge Osmo Action 4.• Reconnect Osmo Action 4 to the computer if a file transfer is interrupted.OTG Connection for Transferring FilesFor the Android devices supporting OTG connection, the files can be transferred from thecamera to the Android device with OTG connection.Connect the camera to an Android device with the Type-C to Type-C PD cable (included) usingthe USB-C port on the camera. When connected, view and transfer the photos and videos of thecamera via the device album or file management.• If the camera cannot automatically recognize the Android device using the OTGconnection, swipe down from the edge of the screen and enter the control menu.Tap Settings > OTG Connection, and use the Type-C to Type-C PD cable to connect thecamera to device.© 2023 DJI All Rights Reserved.21"},{"page": "22","img": "img-22.jpg","content": "DJI Osmo Action 4 User ManualWebcam ModeOsmo Action 4 can work as a webcam on a computer. Power on the camera and connect it tothe computer using a USB-C cable. The camera will go into USB mode. Tap Webcam to enterthe Webcam mode, and the camera will function as a webcam input device. The bottom of thescreen displays Webcam. Press the shutter/record button to start recording. Tap the ImageParameter Settings icon on the right side of the screen to set the exposure, white balance, andFOV parameters. Users can preview recorded videos after exiting the Webcam mode.Microphone ConnectionOsmo Action 4 can be linked to an external microphone, including DJI Mic or any third-partydigital USB-C microphones that support 48K/16bit.Follow the steps below (with DJI Mic as an example) to connect to a microphone:1. Press the release button on the USB-C port cover and slide it downward. Lift the coverupward until it is detached from the device.2. Power on the receiver and transmitter, and make sure the receiver and transmitter arelinked.3. Attach the receiver to the USB-C port of the camera using the USB-C adapter. A microphoneicon will be displayed on the screen.4. Press the linking button on the transmitter to start recording while using the transmitter foraudio. Press the linking button again to stop recording.12REC12• The transmitter and the receiver are linked by default. Follow the steps below to link ifthe transmitter and receiver are disconnected.a. Place the transmitter and the receiver in the charging case to link automatically.b. Power on the transmitter and the receiver, press and hold the link button on thetransmitter, slide down on the screen of the receiver, select Settings and scrollthrough and tap Link Device to start linking. The status LED glows solid green toindicate linking was successful.22© 2023 DJI All Rights Reserved."},{"page": "23","img": "img-23.jpg","content": "DJI Osmo Action 4 User ManualDJI Mimo AppWhen used with the DJI Mimo app, users can monitor the current camera view, set the cameraparameters, and control the camera with a mobile device. The DJI Mimo app enables user toget most out of Osmo Action 4 with a series of functions, such as transferring files, editing andsharing, InvisiStick for Skiing, and Wi-Fi livestream.Download the DJI Mimo AppSearch DJI Mimo in the app store, or scan the QR code to download and install.DJI Mimo AppDJI Store Apphttps://s.dji.com/guide60iOS 12.0 or aboveAndroid 8.0 or aboveConnecting to the DJI Mimo App1. Power on Osmo Action 4.2. Enable Wi-Fi and Bluetooth on the mobile device.3. Launch DJI Mimo, tap, and follow the instructions to activate Osmo Action 4.• If there is a problem when connecting to DJI Mimo, follow the steps below.a. Make sure that both Wi-Fi and Bluetooth are enabled on the mobile device.b. Make sure the DJI Mimo app has the latest firmware version.c. Swipe down from the top of the screen to enter the control menu, select WirelessConnection > Reset Connection. The camera will reset all connections and Wi-Fipasswords.© 2023 DJI All Rights Reserved.23"},{"page": "24","img": "img-24.jpg","content": "DJI Osmo Action 4 User ManualDJI Mimo App Home ScreenLauch DJI Mimo and enter the home screen.Device: tap to connect to Osmo Action 4. Once connected, DJI Mimo enters the cameraview.Academy: tap to watch tutorials and view manuals.TEMPLATEAI Editor: provides several templates for editing photos or videos.Home: tap to return to the home screen.Album: manage and view footage from a mobile device or DJI device.Editor: tap to edit photos or videos on Osmo Action 4 or import them to and edit on amobile device.Profile: register or log in to a DJI account. View works and settings, check likes and followers,send messages to other users, or connect with the DJI Store.24© 2023 DJI All Rights Reserved."},{"page": "25","img": "img-25.jpg","content": "DJI Osmo Action 4 User ManualCamera ViewThe camera view display may differ depending on the shooting mode. This display is forreference only.91.PHOTOVIDEOSLOWMOTIONTIMELAPSE1.0xPHOTO1.0xVIDEO111059:59LIVESTREAM59:59LIVESTREAM5SLOWMOTION2 3 4TIMELAPSE1678Home: tap to return to the home screen.2.Wi-Fi: displays Wi-Fi connection.3.Battery Level: displays the current battery level of Osmo Action 4.4.microSD Card Information: displays either the remaining number of photos that can be taken or the videoduration that can be recorded according to the current shooting mode.5.Custom Mode: tapand tapto save the current configuration as a custom mode. Save theshooting parameters in the custom mode, which can then be used directly to shoot similarscenes. Users can save up to five custom modes.6.Shutter/Record Button: tap to take a photo or to start or stop recording a video.© 2023 DJI All Rights Reserved.25"},{"page": "26","img": "img-26.jpg","content": "DJI Osmo Action 4 User Manual7.Shooting ModesScroll to select the shooting mode.8.Shooting ModesDescriptionHyperlapseUse Hyperlapse to record smooth timelapse videos whenthe camera is in motion (such as in a car or when hand-held).Tap Playback to preview timelapse videos as soon as they arecaptured.TimelapseUse Timelapse to record timelapse videos when the camera ismounted and still. Three presets in Timelapse are designed fortypical scenes such as Crowds, Clouds, and Sunset. Users can alsooptimize the interval and duration for recording timelapse videos.Slow MotionSupports 4x or 8x slow-motion video shooting. In Slow Motionmode, the camera records the video with a high frame rate andslows the footage down to 4x or 8x the normal speed duringplayback. Slow Motion catches details not visible to the nakedeye, which is ideal for fast-action shots. Note: slow-motion videosdo not include audio. The audio file is stored as a standalone fileand has the same path as the videos, which can be transferred toyour computer.VideoRecord a video.PhotoTake a photo or countdown photo.Live StreamOsmo Action 4 supports live broadcasting to livestream platformssuch as YouTube and Facebook.Playback: tap to preview photos and videos as soon as they are captured.9.Settings: set the selected shooting mode as Basic or Pro mode. More settings become availableonce Pro is enabled, including FOV, Format, Exposure and White Balance. Variousparameters can be set when using different shooting modes.10. Shooting Parameters: displays the parameters of the current shooting mode. Tap to set the parameters.11. Zoom: displays the current zoom ratio. Place two fingers on the screen and move them apartto zoom in or pinch together to zoom out.26© 2023 DJI All Rights Reserved."},{"page": "27","img": "img-27.jpg","content": "DJI Osmo Action 4 User ManualMaintenanceFirmware UpdateThe firmware version of Osmo Action 4 is updated using DJI Mimo.Make sure the battery level of Osmo Action 4 is at least 15% before updating its firmwareversion. Connect Osmo Action 4 to the DJI Mimo app. If new firmware is available, users will benotified by DJI Mimo. Update the firmware according to the on-screen instructions. The updatetakes approximately 2 minutes.Underwater Usage NotesOsmo Action 4 can be used underwater at depths of up to 18 m. When used with the OsmoAction 60m waterproof case, the device can operate underwater up to 60 m deep. Observe thefollowing precautions when using the device in water.1. Make sure the battery and battery compartment are dry and clean before inserting thebattery. Otherwise, it may affect the battery contact and waterproofing ability. Make sure thebattery compartment cover is firmly fastened after the battery is inserted. Note: if the coveris properly mounted, the red marks on the bottom will not be visible.2. Make sure the USB-C port cover is clean and closed before using. Otherwise, it will affect thedevice waterproofing ability.3. Make sure the lens protective cover is clean and closed before using. Otherwise, it will affectthe device waterproofing ability. Make sure the lens protective cover and lens are dry andclean. Sharp or hard objects may damage the lens and affect the ability of the device. Makesure the lens protective cover are firmly mounted and fastened.4. Osmo Action 4 is not waterproof unless the battery compartment cover, USB-C port cover,and lens protective cover are firmly mounted and fastened. The camera is NOT waterproofwhen used with Osmo Action Lens Hood.5. Avoid jumping into water at high speed with Osmo Action 4. Otherwise, the impact mayresult in water seepage. Make sure the camera is waterproofed before jumping into water.6. DO NOT use Osmo Action 4 in hot springs or extreme underwater environments. DO NOTlet Osmo Action 4 to come into contact with corrosive or unknown liquids.7. Rinse the camera with clean water after using it underwater. Allow it to dry naturallybefore using again. DO NOT dry the camera with hot air using a hair dryer, otherwise themicrophone membrane and the built-in breathable membrane will rupture, and the camerawill no longer be waterproof.Attach the waterproof case to Osmo Action 4 when using it while diving, surfing, underwater foran extended period, or in other situations involving high water impact. Observe the followingprecautions when using the device with the waterproof case:1. Make sure the rubber seal is clean and firmly attached during use.2. Make sure the waterproof case is dry (for best results, place anti-fog fiber in the case duringuse) and the latch is secure.© 2023 DJI All Rights Reserved.27"},{"page": "28","img": "img-28.jpg","content": "DJI Osmo Action 4 User Manual3. Before use, it is recommended to place the waterproof case underwater for approximately 5minutes to ensure it is working properly.4. Rinse the case with tap water to prevent corrosion after using it in the sea.• The touchscreens of Osmo Action 4 can be operated when their surface is wet.• The touchscreens cannot function underwater. Users can press the camera buttonsto start recording. Shutter/record button is disabled automatically when the camera isused without Osmo Action waterproof case at a depth of more than 14 m.Cleaning Notes1. Clean the lens protective cover with water or a lens cleaning pen, lens air blower, or lenscleaning cloth. When changing the lens protective cover, make sure the camera is dry. Afterusing Osmo Action 4 in water, let the camera dry before using it again. This will preventwater from seeping into the lens protective cover and fogging up the lens. DO NOT removethe lens protective cover frequently to avoid dust accumulating inside the lens cover, whichcan affect shooting quality.2. Clean the lens with a lens cleaning pen, lens air blower, or lens cleaning cloth.3. Clean the battery and battery compartment with a clean, dry cloth.Make sure the quick-release slots on the camera are clean from dust and sand when attachingthe Quick-Release Adapter Mount.Battery Usage Notes1. DO NOT use non-DJI OSMO batteries. New batteries can be purchased at www.dji.com. DJIOSMO shall not be responsible for any fault or damage caused by the use of any non-DJIOSMO batteries.2. The battery should be used at temperatures between -20° to 45° C (-4° to 113° F ). Use ofthe battery at temperatures above 45° C (113° F) can lead to a fire or explosion. Before usingthe battery in a low-temperature environment, it is recommended to charge the battery fullyin a normal temperature environment. Charging the battery at the ideal temperature canprolong battery life.3. Battery performance will be affected if the battery is not used for an extended period.4. Discharge and charge the battery completely once every three months to keep it in goodworking condition.5. Remove the battery from Osmo Action 4 and store the battery in the Osmo ActionMultifunctional Battery Case when stored for an extended period.28© 2023 DJI All Rights Reserved."},{"page": "29","img": "img-29.jpg","content": "DJI Osmo Action 4 User ManualUsing Other Accessories (Not Included)AccessoryDiagramOsmo 1.5m Extension Rod≈1.5m1. Adjust the telescopic length of the extension rodappropriately when in use.2. DO NOT drop or strike the extension rod in anyway when in use to avoid damage.3. DO NOT shake the extension rod violently wheninstalled with the camera to avoid damage.4. Rinse with clean water to remove sand afterunderwater usage.5. DO NOT use the extension rod duringthunderstorms to avoid lightning strikes.Osmo Magnetic Ball-Joint AdapterMount© 2023 DJI All Rights Reserved.29"},{"page": "30","img": "img-30.jpg","content": "DJI Osmo Action 4 User ManualOsmo Action 60m Waterproof CaseDJI Floating HandleOsmo Action Suction Cup MountOsmo Action Helmet Chin Mount30© 2023 DJI All Rights Reserved."},{"page": "31","img": "img-31.jpg","content": "DJI Osmo Action 4 User ManualOsmo Action Chest Strap MountOsmo Action Handlebar MountOsmo Action GPS Bluetooth RemoteControllerSupport for DJI devices will be updated continuously. Visit https://www.dji.com/osmo-action-4for a complete list.© 2023 DJI All Rights Reserved.31"},{"page": "32","img": "img-32.jpg","content": "DJI Osmo Action 4 User ManualSpecificationsGeneralDimensions70.5×44.2×32.8 mm (L×W×H)Weight145 gWaterproof18 m [1] without the Waterproof Case, 60 m with theWaterproof CaseNumber of Microphones3TouchscreensFront Screen: 1.4-inch 323 ppi 320×320Rear Screen: 2.25-inch 326 ppi 360×640Front/Rear Screen Brightness: 750±50 cd/m²Supported SD CardsmicroSD (up to 512 GB)Recommended microSD CardsRecommended models:SanDisk Extreme Pro 32GB V30 A2 UHS-I Speed Grade 3Kingston Canvas Go!Plus 64GB UHS-I Speed Grade 3Kingston Canvas Go!Plus 128GB UHS-I Speed Grade 3Kingston Canvas React Plus 64GB UHS-II Speed Grade 3Kingston Canvas React Plus 128GB UHS-II Speed Grade 3Kingston Canvas React Plus 256GB UHS-II Speed Grade 3Lexar Pro 256GB SDXC UHS-I V30 R160/W120 (1066x)Lexar Pro 512GB SDXC UHS-I V30 R160/W120 (1066x)CameraSensor1/1.3-inch CMOSLensFOV: 155°Aperture: f/2.8Focus Range: 0.4 m to ∞ISO RangePhoto: 100-12800Video: 100-12800Electronic Shutter SpeedPhoto: 1/8000-30 sVideo: 1/8000 s to the limit of frames per secondMax Photo Resolution3648×2736ZoomDigital ZoomPhoto: 4×Video: Max 2×Slow Motion/Timelapse: not availableStill Photography ModesSingle: Approx. 10 MPCountdown: Off/0.5/1/2/3/5/10 s32© 2023 DJI All Rights Reserved."},{"page": "33","img": "img-33.jpg","content": "DJI Osmo Action 4 User ManualStandard Recording4K (4:3): 3840×2880@24/25/30/48/50/60fps4K (16:9): 3840×2160@100/120fps4K (16:9): 3840×2160@24/25/30/48/50/60fps2.7K (4:3): 2688×2016@24/25/30/48/50/60fps2.7K (16:9): 2688×1512@100/120fps2.7K (16:9): 2688×1512@24/25/30/48/50/60fps1080p (16:9): 1920×1080@100/120/200/240fps1080p (16:9): 1920×1080@24/25/30/48/50/60fpsSlow Motion4K: 4× (120fps)2.7K: 4× (120fps)1080p: 8× (240fps), 4× (120fps)Hyperlapse4K/2.7K/1080p: Auto/×2/×5/×10/×15/×30Timelapse4K/2.7K/1080p@30fpsIntervals: 0.5/1/2/3/4/5/6/8/10/15/20/25/30/40 sDuration: 5/10/20/30 mins, 1/2/3/5 hours, ∞StabilizationEIS[2]:RockSteady 3.0RockSteady 3.0+HorizonBalancingHorizonSteadyMax Video Bitrate130 MbpsSupported File SystemexFATPhoto FormatJPEG/RAWVideo FormatMP4 (H.264/HEVC)Built-in Storage CapacityThe camera does not have built-in storage, but storagecapacity can be expanded by inserting a microSD card.Audio Output48 kHz 16-bit; AACBatteryTypeLiPo 1SCapacity1770 mAhEnergy6.8 WhVoltage3.85 VOperating Temperature-20° to 45° C (-4° to 113° F)Charging Temperature5° to 40° C (41° to 104° F)Operating Time160 minutes[3]ConnectionWi-Fi Operating Frequency2.4000-2.4835 GHz5.150-5.250 GHz5.725-5.850 GHz© 2023 DJI All Rights Reserved.33"},{"page": "34","img": "img-34.jpg","content": "DJI Osmo Action 4 User ManualWi-Fi Protocol802.11 a/b/g/n/acWi-Fi Transmitter Power (EIRP)2.4 GHz: < 15 dBm (FCC/CE/SRRC/MIC)5.1 GHz: < 16 dBm (FCC/CE/SRRC/MIC)5.8 GHz: < 14 dBm (FCC/CE/SRRC)Bluetooth Operating Frequency2.400-2.4835 GHzBluetooth Transmit Power (EIRP)<3 dBmBluetooth ProtocolBLE 5.0[1] Before use, close the battery compartment cover and the USB-C port cover, and tighten the LensProtective Cover. It is recommended to install the Waterproof Case for long-duration underwater shootingor in environments with high water impact pressure. Osmo Action 4 and its Waterproof Case have an IP68waterproof rating. Do not use the camera in hot springs or extreme underwater environments, or let itcome into contact with corrosive or unknown liquids.[2] EIS is not supported in Slow Motion and Timelapse modes. HorizonSteady is only available when the videoresolution is 1080p (16:9) or 2.7K (16:9) with a frame rate of 60fps or below. HorizonBalancing is onlyavailable when the video resolution is 1080p (16:9), 2.7K (16:9), or 4K (16:9) with a frame rate of 60 fps orbelow.[3] Tested at room temperature (25°C/77°F) and 1080p/24fps (16:9), with RockSteady on, Wi-Fi off, and screenoff. This data is for reference only.34© 2023 DJI All Rights Reserved."},{"page": "35","img": "img-35.jpg","content": "DJI Osmo Action 4 User ManualWi-Fi Protocol802.11 a/b/g/n/acWi-Fi Transmitter Power (EIRP)2.4 GHz: < 15 dBm (FCC/CE/SRRC/MIC)5.1 GHz: < 16 dBm (FCC/CE/SRRC/MIC)5.8 GHz: < 14 dBm (FCC/CE/SRRC)Bluetooth Operating Frequency2.400-2.4835 GHzBluetooth Transmit Power (EIRP)<3 dBmBluetooth ProtocolBLE 5.0[1] Before use, close the battery compartment cover and the USB-C port cover, and tighten the LensProtective Cover. It is recommended to install the Waterproof Case for long-duration underwater shootingor in environments with high water impact pressure. Osmo Action 4 and its Waterproof Case have an IP68waterproof rating. Do not use the camera in hot springs or extreme underwater environments, or let itcome into contact with corrosive or unknown liquids.[2] EIS is not supported in Slow Motion and Timelapse modes. HorizonSteady is only available when the videoresolution is 1080p (16:9) or 2.7K (16:9) with a frame rate of 60fps or below. HorizonBalancing is onlyavailable when the video resolution is 1080p (16:9), 2.7K (16:9), or 4K (16:9) with a frame rate of 60 fps orbelow.[3] Tested at room temperature (25°C/77°F) and 1080p/24fps (16:9), with RockSteady on, Wi-Fi off, and screenoff. This data is for reference only.34© 2023 DJI All Rights Reserved."}]